#include<stdio.h>
main()
{
	int a,b,c;
	for(;1;)
	{

//*********
			//scanf  ("%1d%1d%1d",&a,&b,&c);
		    //依次读取输入缓存区一个一个数字,对于空格是无视的

//*********
		    //scanf  ("%d%d%d",&a,&b,&c);
			//使用空格或者换行键来区分开三个数字,不管数字之间的空格或者换行有多少个，
			//一定会等到三个数字都输入才执行输出语句,和上面一样，缓存区的数字是依次读取
			//多出三个的那些数字留到下一次输入
			
//*********
		    scanf ("%1d,%1d,%1d",&a,&b,&c);//这种情况较复杂，以后分析
			//一定要把逗号原样输入，否则就会死掉

1,222,3
**1**2**-858993460**
**2**2**-858993460**
**2**3**-858993460**




            printf ("**%d**%d**%d**\n",a,b,c);
	}
}